; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 188817 2 3 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	spectrograph1 - mode
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(have_image Star7 spectrograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 3
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
3. (turn_to satellite0 phenomenon8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 3
4. (turn_to satellite1 groundstation6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 3
5. (calibrate satellite1 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 3
6. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 3
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 0 of 3
8. (turn_to satellite1 phenomenon8 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 3
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
10. (take_image satellite1 phenomenon8 instrument3 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 1 of 3
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 3
12. (turn_to satellite1 star7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star7)
   goals met: 1 of 3
13. (turn_to satellite0 star7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star7)
   goals met: 1 of 3
14. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 2 of 3
15. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   goals met: 2 of 3
16. (turn_to satellite0 planet9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet9)
   goals met: 2 of 3
17. (take_image satellite1 planet9 instrument3 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 3 of 3
